{
  "slogan": "Empower Yourself to Empower Your Career",
  "summary": [
    "The IT Academy curriculum focuses on the most relevant, real-world software engineering skills, including algorithms, coding fundamentals and principles, object-oriented design, and system design.",
    "Our unique approach combines real-world examples with academic foundations in a collaborative setting. Our interactive environment allows students to ask/answer questions, discuss their ideas with instructors and students, and receive hands-on assistance."
  ],
  "program": [
    "All with high success rate as the standard, we accompany the students through the whole process of job application. Our goal is to make our training courses the most useful one for each student aiming to work as a software engineer.",
    "Our courses are interactive. Students are getting actively involved by asking/answering questions, demonstrating his/her code, and discussing ideas with teachers and other students. After class, students can use our online system (code.laioffer.com) for coding practice. Our coding instructor will also provide hands-on help.",
    "The whole training program lasts 3 months, covering the following CS fundamentals:"
  ],
  "algorithms": [
    "Algorithms are recipes for solving computational problems. You will study fundamental algorithms for solving a variety of problems, including sorting, searching, and graph algorithms.",
    "More importantly, our training focuses on general design and analysis techniques that underlie these algorithms. For example, we will examine divide-and-conquer, dynamic programming, greediness, and probabilistic approaches.",
    "You will also learn techniques for analyzing time and space complexity of algorithms and will use these to evaluate real-world tradeoffs."
  ],
  "programmingLanguages": [
    "We focus on basic concepts and solution implementation using various programming languages as examples. A lot of detail is given to the concepts and features of the programming language itself.",
    "We provide both detailed training on how to understand and utilize the programming languages as an engineering tool to solve real problems and an introduction of some in-depth topics about the programming language itself.",
    "Both aspects are very important for building up the engineering knowledge and skills for a qualified individual to develop and maintain moderately large programs.",
    "Time and memory tradeoffs for a variety of methods and data structures will be taught in this class, and the code correctness, efficiency, and style will also be areas of focus."
  ],
  "ooDesign": [
    "We review all the important object-oriented programming concepts, including encapsulation, inheritance, and polymorphism. Instead of only memorizing “what” these concepts are, you will dive into code extracted from open source projects to learn “how” these are utilized in the real world.",
    "We will explore how to divide up complicated design problems into a hierarchy of classes and how to define the best interaction between these classes. Detailed examples are used to make the theoretical methods easier to understand.",
    "We will also introduce common design patterns, and focus on the core motivation of these patterns so that you will understand why these patterns are useful and how they can be used to improve the quality of your code."
  ],
  "systemDesign": [
    "We will introduce basic concepts and common algorithms in large-scale systems. You will learn various challenges for systems with scale, and corresponding design principles. The course covers topics such as distributed storage systems, big data batch processing and stream processing.",
    "You will dive into design details of popular open-source systems and frameworks (e.g. Hadoop, Cassandra, Spark, and Kafka). You will also have opportunities to use what you have learned to design highly-scalable web applications."
  ],
  "projectGoal": [
    "The goal of the Project courses is to provide students with a comprehensive training of project design and implementation. Our courses cover hot techniques in web development, mobile development, and big data and data science, and enable students to understand the whole lifecycle of project development starting from brainstorming, business design, and engineering design.",
    "After taking this course, students are expected to have full-stack software development experience, as well as the capabilities to development their own projects with new tech stacks."
  ],
  "studentProjectsIntro": "As part of the training, our students build apps from the ground up. Here are a few examples:",
  "studentProjects": [{
    "title": "Restaurant Recommendation",
    "image": "",
    "description": "Chihuo (foodie) uses personalized information to improve restaurant search and recommendations based on search history and  favorites’ record. The project developed an interactive website for users to search restaurants, update preference, and view recommended restaurants.",
    "tags": ["Java", "MongoDB", "MySQL"]
  }, {
    "title": "Restaurant Recommendation Android App",
    "image": "",
    "description": "This project developed Chihuo (foodie) on the Android platform. Students learned core techniques for doing Android development. Students built and deployed a user-friendly and backend-supported Android app.",
    "tags": ["HTML", "JavaScript", "CSS3"]
  }, {
    "title": "Data Science",
    "image": "",
    "description": "In this project, you will develop algorithms to cluster unlabeled textual documents into groups and discover latent semantic structures. You will learn how to apply Natural Language Processing methods to cluster unlabeled documents into different groups and visualize results. You will also use different clustering models to identify latent structures from documents.",
    "tags": ["Java", "MVC framework", "Android"]
  }, {
    "title": "Link Item",
    "image": "",
    "description": "Link Item is a project designed to provide better recommendations for various products such as books, music Instruments, etc. In this project students used Amazon’s dataset and learned core algorithms to build a recommendation system and develop a MapReduce program to process large datasets.",
    "tags": ["Java", "MongoDB", "MySQL"]
  }],
  "expectListItem": [{
    "icon": "",
    "title": "Sections",
    "count": "12"
  }, {
    "icon": "",
    "title": "Quizzes",
    "count": "3"
  }, {
    "icon": "",
    "title": "Challenges",
    "count": "150"
  }, {
    "icon": "",
    "title": "Projects",
    "count": "3"
  }, {
    "icon": "",
    "title": "Hours",
    "count": "240"
  }, {
    "icon": "",
    "title": "instructors",
    "count": "6"
  }],
  "coursesList": [{
    "title": "Merge Sort"
  }, {
    "title": "Binary Search"
  }, {
    "title": "String"
  }, {
    "title": "Array"
  }, {
    "title": "Recursion"
  }]
}
